---
kind: method
id: M:Autodesk.Revit.DB.DocumentSet.#ctor
source: html/552583ce-32d5-cd1f-cb32-23514be95d42.htm
---
# Autodesk.Revit.DB.DocumentSet.#ctor Method

Initializes a new instance of the DocumentSet class

## Syntax (C#)
```csharp
public DocumentSet()
```